
#### Terraform Apply 📖`success`

<details><summary>Show Apply</summary>

```
Acquiring state lock. This may take a few moments...
data.nsxt_policy_tier0_gateway.t0_0: Reading...
data.nsxt_policy_tier0_gateway.t0_0: Read complete after 0s [id=e2077675-a8f7-4106-bf0f-6b5e3cb3a08a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # nsxt_policy_segment.seg_1 will be created
  + resource "nsxt_policy_segment" "seg_1" {
      + connectivity_path   = (known after apply)
      + description         = "DB Segment - test-t1-dr2"
      + display_name        = "test-t1-dr2-db-segment"
      + id                  = (known after apply)
      + nsx_id              = (known after apply)
      + overlay_id          = 0
      + path                = (known after apply)
      + replication_mode    = "MTEP"
      + revision            = (known after apply)
      + transport_zone_path = "/infra/sites/default/enforcement-points/default/transport-zones/fc78b510-498c-4324-9d3c-72886b931e56"
      + vlan_ids            = []

      + subnet {
          + cidr        = "192.168.100.1/24"
          + dhcp_ranges = []
          + network     = (known after apply)
        }
    }

  # nsxt_policy_segment.seg_2 will be created
  + resource "nsxt_policy_segment" "seg_2" {
      + connectivity_path   = (known after apply)
      + description         = "App Segment - test-t1-dr2"
      + display_name        = "test-t1-dr2-app-segment"
      + id                  = (known after apply)
      + nsx_id              = (known after apply)
      + overlay_id          = 0
      + path                = (known after apply)
      + replication_mode    = "MTEP"
      + revision            = (known after apply)
      + transport_zone_path = "/infra/sites/default/enforcement-points/default/transport-zones/fc78b510-498c-4324-9d3c-72886b931e56"
      + vlan_ids            = []

      + subnet {
          + cidr        = "192.168.200.1/24"
          + dhcp_ranges = []
          + network     = (known after apply)
        }
    }

  # nsxt_policy_tier1_gateway.t1_1 will be created
  + resource "nsxt_policy_tier1_gateway" "t1_1" {
      + default_rule_logging      = false
      + description               = "Demo-39 T1 Router - test-t1-dr2"
      + display_name              = "test-t1-dr2"
      + edge_cluster_path         = (known after apply)
      + enable_firewall           = true
      + enable_standby_relocation = false
      + failover_mode             = "NON_PREEMPTIVE"
      + force_whitelisting        = false
      + ha_mode                   = "NONE"
      + id                        = (known after apply)
      + ipv6_dad_profile_path     = "/infra/ipv6-dad-profiles/default"
      + ipv6_ndra_profile_path    = "/infra/ipv6-ndra-profiles/default"
      + nsx_id                    = (known after apply)
      + path                      = (known after apply)
      + pool_allocation           = "ROUTING"
      + revision                  = (known after apply)
      + route_advertisement_types = [
          + "TIER1_IPSEC_LOCAL_ENDPOINT",
        ]
      + tier0_path                = "/infra/tier-0s/e2077675-a8f7-4106-bf0f-6b5e3cb3a08a"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
nsxt_policy_tier1_gateway.t1_1: Creating...
nsxt_policy_tier1_gateway.t1_1: Creation complete after 0s [id=2b73fa0f-6139-492a-bc6f-564dd7eff7ad]
nsxt_policy_segment.seg_2: Creating...
nsxt_policy_segment.seg_1: Creating...
nsxt_policy_segment.seg_1: Creation complete after 1s [id=b4fd5c93-f549-465a-bf9b-1c9e3c1311ee]
nsxt_policy_segment.seg_2: Creation complete after 1s [id=d8175eba-051f-43c1-a1ce-a2d17ed0e76e]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

</details>

*Folder: `projects/EUDEV/test-t0-shr/customers/test-t1-dr2/101-dres`*
